<?php
// +----------------------------------------------------------------------
// | FileName: config.php
// +----------------------------------------------------------------------
// | Description: 系统前台配置文件
// +----------------------------------------------------------------------
// | Author: 王南
// +-----------------------------------------------------------------------
// | Create Date: 2014-02-11 22:51:16
// +-----------------------------------------------------------------------
// | Alter Date: 
// +-----------------------------------------------------------------------
return array(
    //'配置项'=>'配置值'
    
    // 当前应用的配置
    $config = array(
        //'配置项'=>'配置值'
        'TMPL_PARSE_STRING' => array(   // 自定义模板替换规则
            '__CSS__'    => __ROOT__."/Home/Tpl/Public/Css/",     // 增加新的CSS文件存放的文件夹替换规则
            '__JS__'     => __ROOT__."/Home/Tpl/Public/Js/",      // 增加新的JS类库替换规则
            '__IMAGES__' => __ROOT__."/Home/Tpl/Public/Images/",  // 增加新的Images路径替换规则
            '__BCSS__'   => __ROOT__.'/Public/bootstrap/css/',    // 增加新的Bootstrap的CSS路径替换规则
            '__BJS__'    => __ROOT__.'/Public/bootstrap/js/',     // 增加新的Bootstrap的JS路径替换规则
            '__BIMG__'   => __ROOT__.'/Public/bootstrap/img/',    // 增加新的Bootstrap的IMG路径替换规则
        ),
    );
);
?>
