<?php
// +-----------------------------------------------------------------------
// | FileName: common.php
// +-----------------------------------------------------------------------
// | Description: 分组函数库文件
// +-----------------------------------------------------------------------
// | Author: 王南
// +-----------------------------------------------------------------------
// | Create Date: 2014-01-02 23:20:23
// +-----------------------------------------------------------------------
// | Alter Date: 2014-01-02 23:24:36
// +-----------------------------------------------------------------------

/**
 *  后台自动输出当前登录用户的admid函数(主要用于自动填充)
 */
function get_admid() {
    return 1;
    return $_SESSION['admin']['admid'];
}

/**
 *  获取用户的昵称
 */
function get_admname() {
    return 'wangnan';
    return $_SESSION['admin']['realname'];
}

/**
 *  获取客户端IP的函数
 */
function get_ip() {
    return $_SERVER['REMOTE_ADDR' ];
}
